#include <iostream> //операторы для ввода и вывода данных
#include <locale> //локализация

using namespace std; //для использования без префикса

int main() {
    setlocale(LC_ALL, ".65001"); //подключение кириллицы

    int n, m; //объявление целочисленных переменных

    cout << "Введите n: "; //вывод
    cin >> n; //ввод
    cout << "Введите m: ";
    cin >> m;

    int m0 = m, n0 = n; //сохранение начальных значений 

    // 1. n+++m
    int res1 = n+++m;
    cout << "n+++m = " << res1 << " (стало: n = " << n << ", m = " << m << ")" << endl;

    m = m0; n = n0; //сброс

    // 2. m-- >n
    bool res2 = (m-- > n); //bool показывает истинность выражения
    cout << "m-- > n = " << boolalpha << res2 << " (стало: m = " << m << ", n = " << n << ")" << endl; //boolalpha выводит bool как true/false, а не 1/0

    m = m0; n = n0; //сброс

    // 3. n-- > m
    bool res3 = (n-- > m);
    cout << "n-- > m = " << boolalpha << res3 << " (стало: n = " << n << ", m = " << m << ")" << endl;

    cout << "Постфиксный n++ сначала использует старое значение n, а потом увеличивает его на 1." << endl;
    cout << "Постфиксный m-- сначала использует старое значение m, а потом уменьшает его на 1." << endl;

    return 0; //для успешного завершения
}